{
  "pages": [
    {
      "url": "https://www.pinegap.ai/",
      "text": "Pinegap: AI-powered Equity research platform\nFeatures\nTestimonials\nLog In\nSign Up\nSupercharging Equity Analysts with\nAI\nUncover actionable insights, expand stock coverage efficiently, and accelerate idea generation - all while minimizing oversight.\nSign Up\n- For a free trial\nused by top analysts at\nL/S Hedge Funds\nLong-Only Mutual Funds\nEndowments\nRIAs\nUNIQUE FEATURES\nAI-Powered Equity Research Platform\nUnbiased, Real-time, and Actionable Insights\nBuilt by\nBuy-Side\nFor\nBuy-Side\nCompany Primer\nQuickly ramp-up on a company by focusing on what matters\nCurated Models with Insights\nUncover the stories & narratives behind numbers w/o bouncing between PDFs and Excel sheets\nKey Debates & Event Analysis\nStay on top of earnings and conferences, with key debates and recap\nCompare\nResearch a company in the context of its value chain and history\nReadthroughs\nUncover readthroughs coming from peers or across industries\nQuantamental\nMiss/Beat prediction on companies' different KPIs and line items wrt consensus.\nIntelligence is here\nIntroducing\nPine AI\nAgents\nPine AI agents are tireless, super-smart interns — each trained to master a specific task.\nPine AI Agents\nMonitors public company filings to detect management changes, changes in the risks andinsider buying and selling activity in real time.\nThesis Tracker Agent\nMonitors earnings, filings, conferences, and news to track how recent events impact your investment thesis in real time.\nlisten from the users\nWhat our\nusers\nare saying\nDiscover how Pinegap transforms workflows—trusted by analysts at leading buy side funds to turn data overload into actionable edge.\n“\nPinegap uses AI to automate 75% of analyst workflows, freeing up valuable analyst research hours, allowing them to focus on the more fundamental and subjective aspects of equity research that require an analyst's unique perspective.\n”\nDirector of Research\nat $40Bn Long only mutual fund\n“\nPinegap really helps me ramp up on a company quickly, which allows me to do thorough research on companies of interest and their competitors simultaneously. In addition, the development team is responsive - rolling out new enhancements promptly. UI is a pleasure to use.\n”\nPartner and Portfolio Manager\nat $500Mn RIA\n“\nSuch a saviour - if Bloomberg read my mind this is how it would be.\n”\nAnalyst\nat $12Bn L/S Hedge fund\n“\nWhether it’s getting up to speed on new ideas, monitoring portfolio holdings, or tracking trends across industries and value chains, Pinegap’s got you covered.\n”\nPartner and PM\nat $2Bn L/S Hedge fund\n“\nWe've evaluated nearly every AI tool available to investors, but Pinegap stands out. The insights and primer feature is genuinely differentiated, and the improvements they continue to make show they understand what analysts actually need. It's obvious this was built by someone who's been an analyst!\n”\nPartner and Portfolio Manager\nat $50Bn Long only fund\njoin the waitlist\nSign up for a demo & your\nfree trial\ntoday\nDiscover how Pinegap transforms workflows—trusted by analysts at leading funds, RIAs, and hedge funds to turn data overload into actionable edge.\nFirst Name\n*\nLast Name\n*\nEmail\n*\nOrganization\n*\nDesignation\n*\nInstitutional Investor\nIndividual Investor\nFamily Office\nFinancial Advisor\nSell Side Analyst\nOther\nNo. of analysts in your firm\n*\n2-10\n10 - 50\n50-200\n>200\nBook a Demo\nPinegap is an AI-powered equity research platform that helps analysts ensure they don't miss any important insights, increase their stock coverage - time saving, and help in connecting the dots faster - Idea generation.\nMenu\nHome\nAbout\nCareers\nContact\nLegal\nTerms & Conditions\nPrivacy Policy\nAddress\n8 The Green STE A, Dover, DE 19901\n© Pinegap Inc. 2025"
    },
    {
      "url": "https://www.pinegap.ai/privacy-policy",
      "text": "Pinegap.ai | Privacy Policy\nPINEGAP INC.\nPinegap.ai | Privacy Policy\nThis Privacy Policy explains how Pinegap Technologies, Inc. (Pinegap, we, our, or us) collects, uses, shares, and safeguards personal and organizational data when you (Customer or User) interact with our AI-powered equity research platform, Pinegap.ai (Service).\n1. WHO WE ARE\nPinegap is an artificial intelligence and cybersecurity company headquartered in 80 Slope Dr, Short Hills, NJ 07078, United States. We design and deliver AI-powered cybersecurity platforms, predictive analytics solutions, and compliance tools to enterprise clients worldwide.\nIn most cases, Pinegap acts as a Data Controller, determining the purposes and means of processing personal and organizational data collected through our Services. In limited circumstances, such as under managed service agreements, we act as a Data Processor, processing personal data solely on the instructions of our clients.\nPinegap is committed to maintaining high standards of data protection and privacy in accordance with applicable global data protection laws.\n2. SCOPE\nThis Privacy Policy applies to personal and organizational data collected through Pinegap's websites (including Pinegap.ai), platforms, applications, customer support channels, marketing activities, and enterprise interactions (collectively, the Services).\nThis Privacy Policy does not apply to third-party websites, services, integrations, or other entities that may be accessible through our Services. We are not responsible for the privacy practices of third parties, and we encourage you to review their privacy policies separately.\n3. INFORMATION WE COLLECT\nWe collect and process both personal data and organizational data to provide, operate, and improve our Services. The types of information we collect fall into the following categories:\nA. DATA YOU PROVIDE DIRECTLY\nWe collect information you voluntarily provide when interacting with our Services, including:\nAccount Information.\nSuch as your name, business email address, job title, organization name, billing details, and authentication credentials.\nCommunications.\nRecords of correspondence when you contact customer support, sales representatives, or participate in surveys, research studies, or feedback sessions.\nUploaded Content.\nFiles, documents, queries, and other data submitted through our platforms. Uploaded content may include sensitive organizational or proprietary information depending on your use of the Services.\nB. DATA WE COLLECT AUTOMATICALLY\nWhen you access or use our Services, we automatically collect certain technical and usage information, including:\nPlatform Usage Data.\nRecords of your interactions with the Services, such as access times, feature usage metrics, clickstream data, error logs, and operational timestamps.\nDevice & Technical Information.\nInformation about your device, including IP address, device type, operating system version, browser type, screen resolution, language preferences, and approximate geolocation (derived from IP address).\nCookies & Tracking Technologies.\nWe use cookies, pixel tags, and similar tracking technologies to enhance the functionality of our Services, monitor platform performance, and understand user behavior. For more information on our use of cookies and how to manage your preferences, please refer to our Cookie Policy (below).\nC. DATA WE RECEIVE FROM THIRD PARTIES\nWe may receive data about you from third-party sources, including:\nAnalytics Providers.\nAggregated and anonymized usage and performance data provided by third-party analytics services (e.g., Google Analytics).\nCloud Infrastructure & Hosting Providers.\nMetadata related to service usage and performance, which does not include access to the content you upload.\nMarketing Partners & Business Affiliates.\nBusiness contact information, professional profiles, or referral details provided in accordance with applicable law, typically obtained through industry events, partnerships, or referrals.\nWe take steps to ensure that third parties providing your data have secured the necessary permissions and comply with applicable data protection laws.\n4. HOW WE USE YOUR INFORMATION\nA. PRIVACY REGULATIONS\nWe process your personal data in accordance with the following data protection laws where they apply:\nThe General Data Protection Regulation (EU GDPR);\nThe United Kingdom General Data Protection Regulation (UK GDPR);\nThe United Kingdom Data Protection Act 2018 (UK DPA);\nThe California Consumer Privacy Act (CCPA) and California Privacy Rights Act (CPRA);\nThe Personal Information Protection & Electronic Documents Act (PIPEDA) (Canada);\nThe Lei Geral de Proteção de Dados (LGPD) (Brazil).\nB. LEGAL BASES\nWhere required under these laws, we rely on one or more of the following legal grounds to process your personal data:\nConsent.\nWe obtain your consent before placing non-essential cookies, sending marketing communications, or processing data for purposes that require prior approval. You may withdraw your consent at any time without affecting the lawfulness of processing based on consent before its withdrawal.\nContractual Necessity.\nWe process personal data as necessary to perform our contractual obligations, such as providing access to the Services, maintaining your account, and delivering customer support.\nLegitimate Interests.\nWe process data to operate, improve, and secure our Services; conduct internal analytics; develop new features; and protect against misuse, provided that such interests are not overridden by your fundamental rights and freedoms.\nLegal Obligations.\nWe process data where necessary to comply with applicable laws, regulations, and lawful requests, including obligations related to tax, financial reporting, and cybersecurity.\nVital Interests & Public Interest.\nIn limited circumstances, we may process data to protect vital interests (such as responding to security incidents) or where processing is necessary for reasons of substantial public interest.\nWe maintain documentation of our processing activities and legal bases to demonstrate compliance with applicable data protection laws.\nC. DATA COLLECTION & DISCLOSURE (CCPA AND SIMILAR FRAMEWORKS)\nFor purposes of compliance with the CCPA and similar laws, we make the following disclosures:\nCategories of Personal Information Collected.\nIn the past 12 months, we have collected the following categories of personal information: identifiers (such as names, email addresses, and organization details), commercial information (such as records of Services purchased or considered), Internet or network activity (such as browsing history or interactions with our Services), geolocation data (derived from IP addresses), and professional or employment-related information.\nCategories of Personal Information Disclosed.\nIn the past 12 months, we have disclosed the above categories of personal information to service providers and other third parties for business purposes, as described in Section 6 of this Privacy Policy.\nNo Sale or Sharing of Personal Information.\nWe do not sell or share personal information for cross-context behavioral advertising as defined under the CCPA.\nFor a complete description of the recipients of personal data, please refer to Section 6 (Data Sharing and Service Providers) of this Privacy Policy.\nD. SENSITIVE PERSONAL DATA\nWe do not intentionally collect sensitive personal data (such as information revealing racial or ethnic origin, political opinions, religious beliefs, health, or biometric data) unless expressly required and authorized by applicable law or with your explicit consent.\nE. USE OF DATA FOR AI MODEL TRAINING\nWe do not use customer-uploaded content, communications, or personal data to train, retrain, or improve our AI models without your explicit, informed consent. By default, all uploaded customer data remains isolated from model training pipelines. If we seek to use your data for AI model development purposes in the future, we will first obtain your express consent through a separate, clearly presented agreement.\n5. DATA SHARING & SERVICE PROVIDERS\nA. DATA RECIPIENTS\nWe may share personal and organizational data with trusted third parties under the following circumstances:\nService Providers.\nWe engage cloud infrastructure providers (e.g., Amazon Web Services), AI model providers (e.g., OpenAI), analytics services (e.g., Google Analytics), payment processors, and other vendors who assist in operating and securing our Services. These providers are subject to confidentiality obligations and data processing agreements where required by applicable law.\nProfessional Advisors.\nWe may share data with legal, accounting, auditing, or other professional advisors to obtain their services.\nCompliance with Legal Obligations.\nWe may disclose personal data as required to comply with applicable laws, lawful requests, court orders, or legal processes.\nBusiness Transfers.\nIn the event of a merger, acquisition, restructuring, or sale of assets, we may transfer personal data as part of that transaction, subject to applicable data protection requirements.\nWith Consent.\nWhere legally required, we will seek your express consent before sharing your information with third parties for purposes outside the scope of this Privacy Policy.\n6. DATA STORAGE, RETENTION & SECURITY\nA. DATA STORAGE\nWe store and process personal and organizational data using technical, physical, and administrative safeguards designed to meet global privacy and data transfer requirements.\nB. DATA RETENTION\nWe retain personal and organizational data only for as long as necessary to fulfill the purposes for which it was collected, including providing the Services, complying with legal obligations, enforcing our agreements, and resolving disputes. Retention periods include:\nAccount & Usage Data.\nRetained for the duration of your active subscription or service relationship, and for a reasonable period thereafter as required by applicable law or contractual obligations.\nUploaded Content.\nRetained for the duration of your subscription unless you delete it through platform controls or submit a written deletion request. We do not access or use your uploaded content beyond what is necessary to deliver the Services or as permitted by your agreement.\nSupport Communications.\nStored securely in a separate environment and retained only as necessary to resolve the issue. You may request deletion of this correspondence in accordance with applicable law.\nAggregated or Anonymized Data.\nWe may retain non-identifiable data indefinitely for research, analytics, or service improvement purposes, provided it can no longer be associated with any individual or client organization.\nWhere feasible, we may aggregate, de-identify, or anonymize personal data and use it indefinitely for research, analytics, or service improvement purposes. We regularly review our retention practices and implement controls to securely dispose of data when it is no longer needed. You may request deletion of your personal data at any time by contacting us at privacy@pinegap.ai, subject to applicable legal obligations and rights limitations.\nC. DATA SECURITY\nWe implement technical and organizational measures designed to protect personal data against unauthorized access, loss, misuse, or alteration. These safeguards include encryption of data in transit and at rest, access control and authentication protocols, security logging, monitoring and alerting, regular vulnerability testing and penetration assessments, and incident response planning, including data breach notification procedures where required by law. We also require our service providers to maintain equivalent security measures through written agreements. While no system can be guaranteed to be completely secure, we continuously monitor and enhance our security practices to mitigate potential risks.\n7. YOUR RIGHTS\nSubject to applicable data protection laws, you may exercise the following rights regarding your personal data:\nRight to Be Informed.\nYou have the right to receive clear and transparent information about the data we collect, how we use it, and with whom we share it.\nRight of Access.\nYou may request confirmation of whether we process your personal data and obtain a copy of that data.\nRight to Rectification.\nYou may request correction of inaccurate or incomplete personal data.\nRight to Erasure (Right to Be Forgotten).\nYou may request deletion of your personal data under certain conditions, such as when it is no longer necessary for the purposes for which it was collected.\nRight to Restrict Processing.\nYou may request that we temporarily or permanently cease processing all or some of your personal data.\nRight to Object.\nYou may object to the processing of your personal data where we rely on legitimate interests as our legal basis, subject to compelling legitimate grounds for the processing.\nRight to Data Portability.\nYou may request a copy of your personal data in a structured, commonly used, and machine-readable format and transmit that data to another controller where technically feasible.\nRight Not to Be Subject to Automated Decision-Making.\nYou have the right not to be subject to decisions based solely on automated processing that have legal or similarly significant effects.\nUse of Authorized Agents (California Residents).\nIf you are a California resident, you may designate an authorized agent to submit a verifiable request to exercise your rights on your behalf.\nYou may exercise these rights by contacting us at privacy@pinegap.ai. We may require verification of your identity before responding to your request. We will respond to verified requests within the timeframes required by applicable law, typically within 30 days.\nWe may deny requests where permitted by law, such as where fulfilling the request would adversely affect the rights and freedoms of others, conflict with legal obligations, or be manifestly unfounded or excessive. If you are dissatisfied with our response, you may have the right to lodge a complaint with a relevant data protection authority, as outlined in Section 13, below.\n8. YOUR CONTROLS\nWe provide you with options to manage how your personal and organizational data is collected, used, and shared through our Services:\nA. ACCOUNT SETTINGS\nIf you have registered an account with us, you can access, update, or delete certain personal information through your account settings at any time. You may also deactivate your account or request deletion of associated data by contacting us at privacy@pinegap.ai.\nB. COMMUNICATIONS PREFERENCES\nYou may opt out of receiving marketing or promotional communications by following the unsubscribe link in any marketing email. Transactional communications relating to your account or use of our Services (such as security alerts, order confirmations, or account notifications) will continue even if you opt out of marketing messages.\nC. COOKIE & TRACKING PREFERENCES\nYou may manage your cookie preferences, including consenting to or withdrawing consent for non-essential cookies, as described in our Cookie Policy (below).\nD. THIRD-PARTY PLATFORM INTERACTIONS\nIf you interact with us through third-party platforms (e.g., LinkedIn, X/Twitter), those interactions are governed by the privacy policies of the respective platforms. We encourage you to review and adjust your privacy settings directly with those providers.\nE. EXERCISING YOUR RIGHTS\nYou may exercise your privacy rights, request access to your data, or submit a data deletion request by contacting us at privacy@pinegap.ai. We may require verification of your identity before fulfilling such requests, and we reserve the right to deny requests where permitted by applicable law.\n9. COOKIE POLICY\nA. WHAT ARE COOKIES?\nCookies are small text files placed on your device when you visit our websites or use our Services. They serve a variety of functions, including enabling platform functionality, remembering user preferences, enhancing security, and analyzing usage patterns.\nB. COOKIE TYPES USED\nStrictly Necessary Cookies.\nRequired for the operation of our Services, such as authentication, account management, and security. These cookies cannot be disabled through our cookie consent tool.\nPerformance & Analytics Cookies.\nHelp us understand how users interact with our Services by collecting aggregated information on usage patterns and performance metrics.\nFunctional Cookies.\nEnable enhanced functionality and personalization, such as remembering your preferences and settings.\nTargeting & Advertising Cookies.\nUsed by our marketing and social media partners to deliver relevant content and measure the effectiveness of campaigns.\nC. MANAGING COOKIES\nUpon your first visit to our websites, you will be presented with a cookie consent banner that allows you to accept all cookies, reject non-essential cookies, or customize your cookie preferences. You may also manage your cookie settings at any time by clicking the Cookie Settings link available in the website footer.\nYou can control or delete cookies through your browser or device settings. Most browsers allow you to refuse or accept cookies, delete cookies already stored on your device, or alert you when cookies are being placed. Please note that disabling cookies may impact the functionality or availability of certain features within our Services. You may also opt out of targeted advertising from participating partners by visiting:\nNetwork Advertising Initiative. NetworkAdvertising.org/Managing/Opt_Out.asp\nDigital Advertising Alliance. AboutAds.info/Choices/\nEuropean Interactive Digital Advertising Alliance. YourOnlineChoices.eu\nD. DO NOT TRACK SIGNALS\nOur Services do not currently respond to browser-based Do Not Track (DNT) signals. You may use other settings and tools to control data collection and tracking preferences.\nE. UPDATES TO THIS COOKIE POLICY\nWe may update this Cookie Policy from time to time to reflect changes to our practices, legal requirements, or technology. We encourage you to review this section periodically for the latest information.\n10. GENERAL PROVISIONS\nA. POLICY UPDATES\nWe reserve the right to update this Privacy Policy at any time to reflect changes to our practices, legal requirements, or services. When we do, we will revise the Last Updated date at the top. Material changes will be posted prominently or communicated directly when required by law. Continued use of our Services after any update constitutes acknowledgement of the revised Privacy Policy.\nB. CONTACT US\nIf you have questions about this Policy, please contact our Compliance Team at privacy@pinegap.ai.\nC. CONTACT A DATA PROTECTION AUTHORITY\nIf you have a concern about how we may collect and use data, please contact us. You also have the right to contact your local Data Protection Authority (DPA) if you prefer. To contact your local DPA, refer to the links below:\nEEA. DPA Directory (\nhttps://edpb.europa.eu/about-edpb/about-edpb/members_en\n)\nUK. Information Commissioner's Office (ICO) (\nhttps://ico.org.uk/global/contact-us/\n)\nCanada. Office of the Privacy Commissioner (OPC) (\nhttps://www.priv.gc.ca/en/privacy-topics/information-and-advice-for-individuals/reporting-concerns-and-filing-complaints/\n)\nWhere appropriate, your local DPA may also forward the matter to the Department of Commerce or FTC for consideration."
    },
    {
      "url": "https://www.pinegap.ai/terms",
      "text": "Pinegap.ai | Terms of Service\nPINEGAP INC.\nPinegap.ai | Privacy Policy\n1. WELCOME TO PINEGAP\nWelcome to Pinegap.ai, the institutional research platform built for professionals navigating the evolving frontiers of equity analysis. These Terms of Service (\"Terms\") form a binding legal agreement between you (\"Customer\") and Pinegap Technologies, Inc. (\"Pinegap,\" \"we,\" \"our,\" or \"us\") governing your access to and use of our proprietary analytics, interfaces, reports, and AI-enhanced tools (collectively, the \"Service\").\nBy accessing or using the Service, Customer affirms that they are authorized to act on behalf of a financial institution or qualified entity and that you have reviewed and agreed to these Terms, as well as our Privacy Policy. If you do not agree, you may not access the Service.\nThese Terms apply to all access and use of the Service, including any associated data feeds, documentation, beta features, or future enhancements. We reserve the right to update these Terms periodically, and your continued use following such updates constitutes acceptance of the revised Terms.\n2. DEFINITIONS & ELIGIBILITY\nFor purposes of these Terms:\n– \"Customer\" refers to the legal entity entering into this Agreement with Pinegap Technologies, Inc.\n– \"Authorized Users\" means individuals designated by Customer, such as employees, contractors, or affiliated agents, who are permitted to access and use the Service under these Terms.\nAccess to the Service is limited to institutional users, including but not limited to investment firms, banks, research entities, and other regulated financial organizations. By accessing or using the Service, you represent and warrant that you (i) are authorized to act on behalf of a qualifying entity, and (ii) will ensure that all Authorized Users comply with these Terms.\nCustomer further affirms compliance with all applicable regulatory frameworks, including but not limited to those promulgated by the U.S. Securities and Exchange Commission (\"SEC\"), the Financial Industry Regulatory Authority (\"FINRA\"), and any jurisdictionally relevant self-regulatory organizations.\nMisrepresentation of eligibility or failure to comply with regulatory obligations constitutes a material breach of this Agreement and may result in immediate suspension or termination of access.\n3. ACCESS & USAGE RIGHTS\nPinegap grants Customer a limited, non-exclusive, non-transferable, and revocable license to access and use the Service strictly for internal business purposes during Customer`'`s active subscription term.\nUnless explicitly agreed in writing, Customer is prohibited from:\nSharing, publishing, redistributing, commercially exploiting, or otherwise disseminating Pinegap outputs outside Customer`'`s organization.\nCreating, adapting, compiling, or otherwise using Pinegap outputs to produce derivative works intended for resale, redistribution, or use within affiliated entities.\nUsing the Service to develop, train, benchmark, or enhance competing artificial intelligence systems.\nRepurposing outputs as explicit investment recommendations, financial advice, or compliance guarantees.\nThis license may be revoked immediately upon discovery of any breach. Pinegap retains the right to conduct semi-annual audits for compliance verification. Discovery of material breaches during audits may lead to immediate suspension or termination of the Service and imposition of financial penalties equal to twice the subscription fee per unauthorized use or improperly authorized user identified.\n4. INTELLECTUAL PROPERTY\nAll content, materials, and technologies made available through the Service, including but not limited to algorithms, models, analytics, reports, user interfaces, software code, documentation, data visualizations, and workflow methodologies, are the sole property of Pinegap or its licensors. All rights not expressly granted to Customer under these Terms are reserved.\nCustomer retains ownership of Customer Data and any inputs provided to the Service. However, Customer acknowledges that outputs generated by the Service, including any derivative insights, visualizations, or reports, are not Customer`'`s intellectual property. Customer may use such outputs solely within the scope of the access rights defined in Section 3.\nCustomer shall not:\nUse, reproduce, modify, translate, adapt, reverse-engineer, decompile, or disassemble any portion of the Service\nExtract, index, scrape, or compile Service content for use in third-party models, tools, or databases\nUse the Service or any outputs for the purpose of developing, training, validating, benchmarking, or enhancing any artificial intelligence or machine learning systems, whether commercial or experimental\nFeedback, suggestions, or other contributions voluntarily submitted by Customer may be used by Pinegap without restriction. By submitting such contributions, Customer grants Pinegap a perpetual, irrevocable, worldwide, royalty-free, sublicensable license to use, reproduce, adapt, and commercialize such contributions for any lawful purpose without obligation of attribution or compensation.\nAny violation of this section constitutes a material breach and may result in immediate termination of access, revocation of all rights under these Terms, and liability for resulting damages.\n5. CUSTOMER DATA\nCustomer retains full ownership of any data uploaded to the Service (\"Customer Data\"). Pinegap will process such data solely to provide the Service, maintain technical operations, enhance performance, and develop improvements that do not involve Customer-specific outputs. Pinegap will not use Customer Data to train or fine-tune machine learning or artificial intelligence models unless Customer has provided prior, written, and verifiable consent in a manner consistent with applicable data protection laws.\nPinegap may process this information for operational purposes, including diagnostics, service security, fraud prevention, and performance analytics. Such processing may include the use of metadata, access logs, and aggregated metrics, provided it is not used to re-identify Customer or its personnel except as required by law or to investigate security incidents.\nCustomer may request access to, correction of, export of, or deletion of personal data in accordance with applicable privacy regulations, including the General Data Protection Regulation (\"GDPR\") and the California Consumer Privacy Act (\"CCPA\"), as amended. Pinegap reserves the right to deny or defer such requests in its sole discretion where it determines that the request (a) lacks a good-faith basis, (b) is manifestly excessive or repetitive, or (c) is intended to disrupt system performance or business operations.\nThe data will be retained only for as long as necessary to fulfill the purposes outlined in these Terms, comply with legal obligations, or protect Pinegap`'`s legitimate interests related to security, dispute resolution, and compliance. Deletion timelines may be extended in cases involving fraud detection, contractual enforcement, or legal holds.\nPinegap will implement and maintain administrative, technical, and physical safeguards consistent with industry standards to protect Customer Data against unauthorized access, loss, or misuse. Customer is solely responsible for ensuring that any third-party data it uploads is lawfully collected and authorized for processing under applicable data protection laws.\n6. CONFIDENTIALITY\nEach party (\"Receiving Party\") agrees to protect all non-public, proprietary, or confidential information disclosed by the other party (\"Disclosing Party\") in connection with the Service (\"Confidential Information\") using the same degree of care it uses to protect its own similar information, but in no event less than a reasonable standard of care. Confidential Information includes business plans, technical data, algorithms, pricing, financials, and non-public operational information.\nConfidential Information does not include information that (a) is or becomes public through no breach by the Receiving Party, (b) was known to the Receiving Party prior to disclosure, (c) is lawfully obtained from a third party without restriction, or (d) is independently developed without reference to the Disclosing Party`'`s materials.\nIf the Receiving Party receives a subpoena, court order, or regulatory request compelling disclosure of Confidential Information, it shall, to the extent legally permissible, provide written notice to the Disclosing Party within two (2) business days of receiving such request. The Receiving Party shall cooperate with the Disclosing Party in seeking a protective order or other remedy.\nUnauthorized use or disclosure of Confidential Information constitutes a material breach of these Terms. Each party agrees to indemnify and hold harmless the other for losses, damages, or liabilities arising from breach of this Section, whether due to negligence, recklessness, or intentional misconduct.\n7. FEES & BILLING\nFees, payment schedules, and applicable billing terms are set forth in the executed Order Form, which is incorporated by reference and forms part of this Agreement. In the event of a conflict between the Order Form and these Terms, the Order Form shall control with respect to pricing and payment terms.\nUnless otherwise specified:\nAll invoices are due within thirty (30) calendar days of issuance (Net 30)\nLate payments that remain outstanding for more than ten (10) days following written notice shall incur interest at a rate of 2.5% per month or the maximum rate permitted by law, whichever is lower\nPinegap reserves the right to suspend or terminate access to the Service for accounts that are more than ten (10) days overdue\nSubscriptions will automatically renew for successive one-year terms unless terminated in writing at least thirty (30) days prior to the end of the then-current term. Renewals may include a price adjustment of up to ten percent (10%) per annum unless otherwise agreed in writing\nPinegap may engage third-party collection agencies or legal counsel to recover unpaid fees. Customer is responsible for all applicable taxes, duties, and governmental charges, excluding taxes on Pinegap`'`s net income. All fees are stated and must be paid in U.S. dollars, and are non-cancellable and non-refundable except as expressly provided in these Terms or the Order Form.\nCustomer may not withhold, offset, deduct, or reduce fees owed under this Agreement based on any dispute, counterclaim, or right of set-off unless such claim has been finally resolved by written agreement of the parties or by binding arbitration or court order.\n8. NO INVESTMENT ADVICE\nPinegap is not a registered investment advisor, broker-dealer, or fiduciary under any federal or state securities laws, and the Service does not constitute or provide investment advice, legal counsel, regulatory guidance, or any recommendation to buy, sell, or hold any security or asset.\nAll outputs generated by the Service are for general informational purposes only and are based on Customer-provided inputs, third-party data sources, and algorithmic analysis that may be incomplete, inaccurate, or subject to change without notice. Pinegap makes no representations as to the accuracy, timeliness, or completeness of any analysis, forecast, or conclusion derived from use of the Service.\nCustomer acknowledges and agrees that it is solely responsible for evaluating the appropriateness of any output or insight, and for all decisions made in reliance on such information. Customer shall not use the Service as a substitute for professional diligence, legal review, or investment judgment.\nNothing in these Terms shall be construed as creating an advisory relationship, fiduciary obligation, or duty of care between Pinegap and Customer. Pinegap disclaims all liability for losses or damages arising from Customer`'`s use of or reliance on any Service output, to the fullest extent permitted by law.\nAny forward-looking statements or projections made by the Service are inherently speculative and are not guarantees of future results or market performance.\n9. REGULATORY COMPLIANCE & MNPI\nPinegap implements reasonable technical and procedural measures to minimize the risk that outputs generated by the Service will contain material non-public information (\"MNPI\") or otherwise implicate securities law obligations. Pinegap does not warrant that outputs are free from MNPI and does not monitor Customer-provided inputs for compliance with federal or international securities regulations.\nCustomer is solely responsible for ensuring that its use of the Service complies with all applicable laws, including but not limited to the Securities Exchange Act of 1934, Rule 10b-5, FINRA regulations, the Investment Advisers Act of 1940, and any equivalent international frameworks. Customer shall not upload, input, reference, or derive outputs from MNPI or other restricted data and shall not use the Service to support or facilitate market manipulation, insider trading, or regulatory circumvention.\nThe Service is not designed to support automated decision-making processes with legal or similarly significant effects, including decisions subject to GDPR, the EU Artificial Intelligence Act, or analogous international frameworks. Customer bears full responsibility for interpreting, evaluating, and validating outputs before acting upon them.\nCustomer shall not misuse legal, regulatory, or compliance processes (e.g., subpoenas, arbitration notices, data subject requests, or takedown demands) to harass, intimidate, or disrupt Pinegap, its personnel, or its business operations. Knowingly false, duplicative, or bad-faith legal process filings constitute a material breach and may result in immediate termination, access restrictions, and legal action.\nCustomer is further responsible for ensuring compliance with applicable export control laws, economic sanctions regulations (including those administered by U.S. Department of Commerce [\"BIS\"], U.S. Department of Treasury [\"OFAC\"]), and any relevant anti-money laundering (\"AML\") or know-your-customer (\"KYC\") requirements. Pinegap disclaims all liability for Customer`'`s failure to meet such obligations.\n10. LIMITATION OF LIABILITY\nTo the maximum extent permitted by law, Pinegap`'`s total cumulative liability arising out of or related to the Service, these Terms, or any related agreement shall not exceed the total fees paid by Customer to Pinegap in the twelve (12) months preceding the event giving rise to the claim.\nIn no event shall Pinegap be liable for any indirect, incidental, consequential, special, exemplary, or punitive damages, including lost profits, data loss, or loss of business opportunity, arising from or related to the use of the Service, even if Pinegap has been advised of the possibility of such damages. These exclusions apply regardless of the legal theory of liability, whether in contract, tort (including negligence), strict liability, or otherwise.\nThe foregoing limitations shall not apply to liability arising from Pinegap`'`s proven fraud or willful misconduct, but shall apply to all other liability, including gross negligence and breach of statutory duty, to the extent permitted by applicable law. Some jurisdictions do not allow exclusion of certain damages; in such cases, Pinegap`'`s liability shall be limited to the minimum extent permitted under applicable law.\nCustomer agrees to indemnify, defend, and hold harmless Pinegap, its affiliates, officers, directors, employees, and agents from and against any and all claims, damages, losses, liabilities, costs, and expenses (including reasonable legal fees) arising out of or related to (a) Customer`'`s breach of these Terms, (b) Customer`'`s misuse or unauthorized reliance on the Service or its outputs, or (c) any third-party claim arising from Customer`'`s use of the Service in violation of applicable law or regulation.\nCustomer`'`s indemnity obligations under this Section shall survive termination or expiration of these Terms.\n11. TERM & TERMINATION\nThese Terms shall remain in effect for the duration of Customer`'`s active subscription to the Service, including any renewal terms as specified in the applicable Order Form (\"Term\"), unless earlier terminated in accordance with this Section.\nEither party may terminate these Terms for material breach upon thirty (30) days`'` written notice, provided that the breach remains uncured at the end of such notice period. Pinegap may additionally suspend or terminate access immediately in the event of (a) non-payment beyond the applicable cure period, (b) Customer`'`s breach of intellectual property or confidentiality obligations, or (c) unlawful or abusive use of the Service.\nUpon termination or expiration of the Term:\nCustomer shall immediately cease all access to and use of the Service\nAll licenses and rights granted to Customer under these Terms shall immediately terminate\nCustomer shall, upon written request, certify deletion of all Pinegap content or materials retained in its systems\nPinegap will retain Customer Data only as required to comply with applicable law, enforce its rights under these Terms, or maintain operational continuity. Any data retained post-termination will remain subject to the confidentiality and data protection obligations herein.\nSections relating to confidentiality, intellectual property, indemnification, limitation of liability, dispute resolution, and any other provision that by its nature should survive termination shall remain in full force and effect.\n12. DISPUTE RESOLUTION\nPrior to initiating any legal proceeding, either party must provide written notice of the dispute and engage in good faith negotiations for at least thirty (30) calendar days. If the parties are unable to resolve the dispute during this period, the dispute shall be submitted to final and binding arbitration administered by the American Arbitration Association (AAA) under its Commercial Arbitration Rules then in effect.\nUnless otherwise agreed in writing, arbitration shall be conducted by a single arbitrator with expertise in commercial law, securities, or intellectual property. The arbitration shall take place in New York County, New York, and the proceedings shall be conducted in English.\nEither party may seek interim or injunctive relief in any court of competent jurisdiction, including but not limited to the state or federal courts located in New York County, New York, to prevent immediate and irreparable harm related to intellectual property or confidentiality, without waiving the right to arbitrate all other claims.\nThese Terms shall be governed by and construed in accordance with the laws of the State of New York, without regard to its conflict of laws principles.\nEach party agrees to resolve disputes only on an individual basis and expressly waives the right to participate in any class, collective, consolidated, or representative proceeding. This waiver applies to all phases of litigation, arbitration, and settlement.\n13. GENERAL TERMS\nThis Agreement consists of these Terms, the Order Form, and Pinegap`'`s Privacy Policy. Together, they constitute the entire agreement between the parties and supersede all prior agreements, understandings, and representations, whether written or oral, relating to the subject matter herein.\nNeither party may assign this Agreement without the prior written consent of the other party, except that Pinegap may assign or transfer this Agreement without consent (a) to an affiliate, or (b) in connection with a merger, acquisition, corporate reorganization, or sale of all or substantially all of its assets.\nNo joint venture, partnership, agency, or employment relationship is created as a result of this Agreement. Customer shall not represent otherwise or bind Pinegap in any manner.\nPinegap may modify, suspend, or discontinue access to features of the Service in response to legal, technical, or business considerations. Pinegap makes no guarantee that any specific feature, functionality, or interface will remain available during the Term.\nEach party agrees to comply with all applicable export control and economic sanctions laws, including those administered by BIS or OFAC, and any analogous laws in jurisdictions where the Service is accessed or used. Customer shall not use, transfer, export, or re-export the Service in violation of such laws.\nFailure to enforce any term of this Agreement shall not be deemed a waiver of such term or any other provision. If any provision of this Agreement is held to be invalid or unenforceable, the remaining provisions shall remain in full force and effect.\nNotices under this Agreement shall be provided in writing and delivered via email to the addresses specified in the Order Form, or to such other address as either party may designate in writing. Notices shall be deemed received on the date of confirmed delivery.\nNeither party shall be liable for any delay or failure to perform due to causes beyond its reasonable control, including but not limited to acts of God, war, terrorism, cyberattacks, labor disputes, pandemic, embargo, or governmental action (each a \"Force Majeure Event\"). The affected party shall promptly notify the other party of the Force Majeure Event and make reasonable efforts to resume performance as soon as practicable.\nObligations shall be suspended for the duration of the Force Majeure Event, but if such event continues for more than thirty (30) consecutive days, either party may terminate this Agreement upon written notice to the other.\nCustomer acknowledges that a breach of the confidentiality, intellectual property, or compliance provisions of this Agreement may cause irreparable harm to Pinegap. Pinegap shall be entitled to seek equitable remedies, including injunctive relief, without the requirement to post bond or prove actual damages, in addition to all other remedies available at law or in equity.\nAny provisions of this Agreement that by their nature should survive termination shall survive.\nFor legal notices, contact: legal@pinegap.ai."
    }
  ]
}